Catalogs/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СтавкиНДС</Name>
			<Comment>Ставки НДС</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ставка</Name>
					<Comment>Ставка налога на добавленную стоимость</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетнаяСтавка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/РаботаСоСтавкамиНДСПовтИсп/Ext/Module.bsl
#Область ПрограммныйИнтерфейс  

// возвращает ссылку на ставку НДС
// Параметры: 
//	Ставка - Число - значение ставки 
//	РасчетнаяСтавка - Булево - признак расчетной ставки
//
// Возвращаемое значение:
//	СправочникСсылка.СтавкиНДС
//
функция СтавкаНДСПоЗначению(Ставка, РасчетнаяСтавка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтавкиНДС.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтавкиНДС КАК СтавкиНДС
		|ГДЕ
		|	СтавкиНДС.Ставка = &Ставка
		|	И СтавкиНДС.РасчетнаяСтавка = &РасчетнаяСтавка
		|	И СтавкиНДС.Ссылка <> ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС)";
	
	Запрос.УстановитьПараметр("РасчетнаяСтавка", РасчетнаяСтавка);
	Запрос.УстановитьПараметр("Ставка", Ставка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Справочники.СтавкиНДС.ПустаяСсылка();
		
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить()[0].Ссылка;
	
КонецФункции

#КонецОбласти
